Repository: tustixoxo/Diabetes-care-with-AI
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es, fr, hi

source: Model not available.
es: Modelo no disponible.
fr: Modèle non disponible.
hi: मॉडल उपलब्ध नहीं है।

source: Diabetic
es: Diabético
fr: Diabétique
hi: मधुमेह

source: Not Diabetic
es: No Diabético
fr: Non Diabétique
hi: मधुमेह नहीं

source: Prediction: %(result)s
es: Predicción: %(result)s
fr: Prédiction: %(result)s
hi: भविष्यवाणी: %(result)s

source: Error during prediction.
es: Error durante la predicción.
fr: Erreur lors de la prédiction.
hi: भविष्यवाणी के दौरान त्रुटि।

source: Diabetes Chatbot
es: Chatbot de Diabetes
fr: Chatbot Diabète
hi: मधुमेह चैटबॉट

source: Diabetes Care
es: Cuidado de Diabetes
fr: Soins du Diabète
hi: मधुमेह देखभाल

source: Prediction
es: Predicción
fr: Prédiction
hi: भविष्यवाणी

source: Lifestyle Check
es: Control de Estilo de Vida
fr: Bilan Mode de Vie
hi: जीवनशैली जांच

source: Chatbot
hi: चैटबॉट

source: Explore Data
es: Explorar Datos
fr: Explorer les Données
hi: डेटा देखें

source: Forum
es: Foro
hi: फोरम

source: Diabetes Expert Chatbot
es: Chatbot Experto en Diabetes
fr: Chatbot Expert en Diabète
hi: मधुमेह विशेषज्ञ चैटबॉट

source: Hello! I'm here to help you understand diabetes and answer your questions. How can I assist you today?
es: ¡Hola! Estoy aquí para ayudarte a entender la diabetes y responder tus preguntas. ¿Cómo puedo ayudarte hoy?
fr: Bonjour! Je suis là pour vous aider à comprendre le diabète et répondre à vos questions. Comment puis-je vous aider aujourd'hui?
hi: नमस्ते! मैं आपको मधुमेह को समझने और आपके सवालों का जवाब देने में मदद करने के लिए यहां हूं। आज मैं आपकी कैसे मदद कर सकता हूं?

source: Type your message
es: Escribe tu mensaje
fr: Tapez votre message
hi: अपना संदेश लिखें

source: Type your message...
es: Escribe tu mensaje...
fr: Tapez votre message...
hi: अपना संदेश लिखें...

source: Send
es: Enviar
fr: Envoyer
hi: भेजें

source: Thinking...
es: Pensando...
fr: Réflexion...
hi: सोच रहा हूं...

source: Sorry, I could not get a response. Please try again.
es: Lo siento, no pude obtener una respuesta. Por favor, inténtalo de nuevo.
fr: Désolé, je n'ai pas pu obtenir de réponse. Veuillez réessayer.
hi: क्षमा करें, मुझे जवाब नहीं मिला। कृपया पुनः प्रयास करें।

source: Sending message, please wait...
es: Enviando mensaje, por favor espera...
fr: Envoi du message, veuillez patienter...
hi: संदेश भेज रहा हूं, कृपया प्रतीक्षा करें...

source: Data Explorer
es: Explorador de Datos
fr: Explorateur de Données
hi: डेटा एक्सप्लोरर

source: Diabetes Prediction
es: Predicción de Diabetes
fr: Prédiction du Diabète
hi: मधुमेह भविष्यवाणी

source: Diabetes Data Explorer
es: Explorador de Datos de Diabetes
fr: Explorateur de Données Diabète
hi: मधुमेह डेटा एक्सप्लोरर

source: Correlation Heatmap
es: Mapa de Calor de Correlación
fr: Carte de Chaleur des Corrélations
hi: सहसंबंध हीटमैप

source: Histogram of Glucose
es: Histograma de Glucosa
fr: Histogramme du Glucose
hi: ग्लूकोज का हिस्टोग्राम

source: Histogram: Glucose
es: Histograma: Glucosa
fr: Histogramme: Glucose
hi: हिस्टोग्राम: ग्लूकोज

source: Histogram of BMI
es: Histograma de IMC
fr: Histogramme de l'IMC
hi: बीएमआई का हिस्टोग्राम

source: Histogram: BMI
es: Histograma: IMC
fr: Histogramme: IMC
hi: हिस्टोग्राम: बीएमआई

source: Back to Home
es: Volver al Inicio
fr: Retour à l'Accueil
hi: होम पर वापस जाएं

source: Diabetes Prediction Project
es: Proyecto de Predicción de Diabetes
fr: Projet de Prédiction du Diabète
hi: मधुमेह भविष्यवाणी परियोजना

source: Diabetes Care Forum
es: Foro de Cuidado de Diabetes
fr: Forum Soins du Diabète
hi: मधुमेह देखभाल फोरम

source: Notifications
es: Notificaciones
hi: सूचनाएं

source: unread notifications
es: notificaciones sin leer
fr: notifications non lues
hi: अपठित सूचनाएं

source: Notifications panel
es: Panel de notificaciones
fr: Panneau de notifications
hi: सूचना पैनल

source: Mark all notifications as read
es: Marcar todas las notificaciones como leídas
fr: Marquer toutes les notifications comme lues
hi: सभी सूचनाओं को पढ़ा हुआ चिह्नित करें

source: Mark all read
es: Marcar todo como leído
fr: Tout marquer comme lu
hi: सभी को पढ़ा हुआ चिह्नित करें

source: Open notification settings
es: Abrir configuración de notificaciones
fr: Ouvrir les paramètres de notification
hi: सूचना सेटिंग्स खोलें

source: No notifications yet
es: Aún no hay notificaciones
fr: Pas encore de notifications
hi: अभी तक कोई सूचना नहीं

source: Share experiences, ask questions, and support the community.
es: Comparte experiencias, haz preguntas y apoya a la comunidad.
fr: Partagez vos expériences, posez des questions et soutenez la communauté.
hi: अनुभव साझा करें, प्रश्न पूछें और समुदाय का समर्थन करें।

source: Share Your Story or Ask a Question
es: Comparte Tu Historia o Haz una Pregunta
fr: Partagez Votre Histoire ou Posez une Question
hi: अपनी कहानी साझा करें या प्रश्न पूछें

source: Type your story or question here... Use @username to mention someone
es: Escribe tu historia o pregunta aquí... Usa @usuario para mencionar a alguien
fr: Tapez votre histoire ou question ici... Utilisez @utilisateur pour mentionner quelqu'un
hi: अपनी कहानी या प्रश्न यहां लिखें... किसी को उल्लेख करने के लिए @उपयोगकर्तानाम का उपयोग करें

source: Post
es: Publicar
fr: Publier
hi: पोस्ट करें

source: Search & Filter Posts
es: Buscar y Filtrar Publicaciones
fr: Rechercher et Filtrer les Publications
hi: पोस्ट खोजें और फ़िल्टर करें

source: Search posts by keyword...
es: Buscar publicaciones por palabra clave...
fr: Rechercher des publications par mot-clé...
hi: कीवर्ड द्वारा पोस्ट खोजें...

source: From Date
es: Desde Fecha
fr: Date de Début
hi: तारीख से

source: To Date
es: Hasta Fecha
fr: Date de Fin
hi: तारीख तक

source: Clear Filters
es: Limpiar Filtros
fr: Effacer les Filtres
hi: फ़िल्टर साफ़ करें

source: Loading posts...
es: Cargando publicaciones...
fr: Chargement des publications...
hi: पोस्ट लोड हो रहे हैं...

source: Forum posts
es: Publicaciones del foro
fr: Publications du forum
hi: फोरम पोस्ट

source: No posts yet — be the first to share!
es: Aún no hay publicaciones — ¡sé el primero en compartir!
fr: Pas encore de publications — soyez le premier à partager!
hi: अभी तक कोई पोस्ट नहीं — पहले साझा करने वाले बनें!

source: No posts found matching your search.
es: No se encontraron publicaciones que coincidan con tu búsqueda.
fr: Aucune publication trouvée correspondant à votre recherche.
hi: आपकी खोज से मेल खाने वाली कोई पोस्ट नहीं मिली।

source: Clear filters and show all posts
es: Limpiar filtros y mostrar todas las publicaciones
fr: Effacer les filtres et afficher toutes les publications
hi: फ़िल्टर साफ़ करें और सभी पोस्ट दिखाएं

source: Previous
es: Anterior
fr: Précédent
hi: पिछला

source: Page
es: Página
hi: पृष्ठ

source: of
es: de
fr: sur
hi: का

source: Next
es: Siguiente
fr: Suivant
hi: अगला

source: Diabetes Care Forum. Empowering lives, one post at a time.
es: Foro de Cuidado de Diabetes. Empoderando vidas, una publicación a la vez.
fr: Forum Soins du Diabète. Améliorer des vies, une publication à la fois.
hi: मधुमेह देखभाल फोरम। एक पोस्ट से जीवन को सशक्त बनाना।

source: Notification Settings
es: Configuración de Notificaciones
fr: Paramètres de Notification
hi: सूचना सेटिंग्स

source: Your Profile
es: Tu Perfil
fr: Votre Profil
hi: आपकी प्रोफ़ाइल

source: Username
es: Nombre de usuario
fr: Nom d'utilisateur
hi: उपयोगकर्ता नाम

source: Enter username
es: Ingresa nombre de usuario
fr: Entrez le nom d'utilisateur
hi: उपयोगकर्ता नाम दर्ज करें

source: Email (for notifications)
es: Correo electrónico (para notificaciones)
fr: Email (pour les notifications)
hi: ईमेल (सूचनाओं के लिए)

source: your@email.com
es: tu@correo.com
fr: votre@email.com
hi: आपका@ईमेल.com

source: Email Notifications
es: Notificaciones por Correo
fr: Notifications par Email
hi: ईमेल सूचनाएं

source: Replies to my posts
es: Respuestas a mis publicaciones
fr: Réponses à mes publications
hi: मेरी पोस्ट पर जवाब

source: Get notified when someone replies
es: Recibe notificaciones cuando alguien responda
fr: Être notifié quand quelqu'un répond
hi: जब कोई जवाब दे तो सूचना प्राप्त करें

source: Mentions (@username)
es: Menciones (@usuario)
fr: Mentions (@utilisateur)
hi: उल्लेख (@उपयोगकर्तानाम)

source: Get notified when you're mentioned
es: Recibe notificaciones cuando te mencionen
fr: Être notifié quand vous êtes mentionné
hi: जब आपका उल्लेख हो तो सूचना प्राप्त करें

source: Subscribed threads
es: Hilos suscritos
fr: Fils abonnés
hi: सब्सक्राइब किए गए थ्रेड

source: Updates on threads you follow
es: Actualizaciones de hilos que sigues
fr: Mises à jour des fils que vous suivez
hi: आपके द्वारा फॉलो किए गए थ्रेड पर अपडेट

source: Save Settings
es: Guardar Configuración
fr: Enregistrer les Paramètres
hi: सेटिंग्स सहेजें

source: Diabetes Care Home
es: Inicio de Cuidado de Diabetes
fr: Accueil Soins du Diabète
hi: मधुमेह देखभाल होम

source: Home
es: Inicio
fr: Accueil
hi: होम

source: Doctor illustration
es: Ilustración de doctor
fr: Illustration du médecin
hi: डॉक्टर चित्रण

source: Welcome to
es: Bienvenido a
fr: Bienvenue à
hi: स्वागत है

source: Your one-stop solution for prediction, lifestyle advice, AI-powered chatbot, and real-time health data insights.
es: Tu solución integral para predicción, consejos de estilo de vida, chatbot con IA e información de salud en tiempo real.
fr: Votre solution complète pour la prédiction, les conseils de mode de vie, le chatbot IA et les informations de santé en temps réel.
hi: भविष्यवाणी, जीवनशैली सलाह, AI-संचालित चैटबॉट और रीयल-टाइम स्वास्थ्य डेटा अंतर्दृष्टि के लिए आपका एकमात्र समाधान।

source: Lifestyle
es: Estilo de Vida
fr: Mode de Vie
hi: जीवनशैली

source: Explore
es: Explorar
fr: Explorer
hi: देखें

source: Passionate about healthcare and AI.
es: Apasionado por la salud y la IA.
fr: Passionné par la santé et l'IA.
hi: स्वास्थ्य सेवा और AI के प्रति उत्साही।

source: Building smart solutions for meaningful impact.
es: Construyendo soluciones inteligentes para un impacto significativo.
fr: Créer des solutions intelligentes pour un impact significatif.
hi: सार्थक प्रभाव के लिए स्मार्ट समाधान बना रहे हैं।

source: Connect with me
es: Conéctate conmigo
fr: Connectez-vous avec moi
hi: मुझसे जुड़ें

source: Diabetes Care Platform
es: Plataforma de Cuidado de Diabetes
fr: Plateforme Soins du Diabète
hi: मधुमेह देखभाल प्लेटफॉर्म

source: Pregnancies
es: Embarazos
fr: Grossesses
hi: गर्भधारण

source: e.g., 2
es: ej., 2
fr: ex., 2
hi: उदा., 2

source: Glucose Level
es: Nivel de Glucosa
fr: Niveau de Glucose
hi: ग्लूकोज स्तर

source: e.g., 130
es: ej., 130
fr: ex., 130
hi: उदा., 130

source: Blood Pressure
es: Presión Arterial
fr: Pression Artérielle
hi: रक्तचाप

source: e.g., 70
es: ej., 70
fr: ex., 70
hi: उदा., 70

source: Skin Thickness
es: Grosor de Piel
fr: Épaisseur de la Peau
hi: त्वचा की मोटाई

source: e.g., 32
es: ej., 32
fr: ex., 32
hi: उदा., 32

source: Insulin Level
es: Nivel de Insulina
fr: Niveau d'Insuline
hi: इंसुलिन स्तर

source: e.g., 85
es: ej., 85
fr: ex., 85
hi: उदा., 85

source: BMI
es: IMC
fr: IMC
hi: बीएमआई

source: e.g., 28.5
es: ej., 28.5
fr: ex., 28.5
hi: उदा., 28.5

source: Diabetes Pedigree Function
es: Función de Pedigrí de Diabetes
fr: Fonction de Pedigree Diabétique
hi: मधुमेह वंशावली फ़ंक्शन

source: e.g., 0.45
es: ej., 0.45
fr: ex., 0.45
hi: उदा., 0.45

source: Age
es: Edad
fr: Âge
hi: आयु

source: e.g., 35
es: ej., 35
fr: ex., 35
hi: उदा., 35

source: Predict
es: Predecir
fr: Prédire
hi: भविष्यवाणी करें

source: Explore Dataset
es: Explorar Conjunto de Datos
fr: Explorer le Jeu de Données
hi: डेटासेट देखें

source: CHECK YOUR LIFESTYLE
es: REVISA TU ESTILO DE VIDA
fr: VÉRIFIEZ VOTRE MODE DE VIE
hi: अपनी जीवनशैली जांचें

source: Personalized Lifestyle Plan
es: Plan de Estilo de Vida Personalizado
fr: Plan de Mode de Vie Personnalisé
hi: व्यक्तिगत जीवनशैली योजना

source: Enter your age
es: Ingresa tu edad
fr: Entrez votre âge
hi: अपनी आयु दर्ज करें

source: BMI (Body Mass Index)
es: IMC (Índice de Masa Corporal)
fr: IMC (Indice de Masse Corporelle)
hi: बीएमआई (बॉडी मास इंडेक्स)

source: Enter your BMI
es: Ingresa tu IMC
fr: Entrez votre IMC
hi: अपना बीएमआई दर्ज करें

source: Not sure? BMI = weight(kg) / height(m)²
es: ¿No estás seguro? IMC = peso(kg) / altura(m)²
fr: Pas sûr? IMC = poids(kg) / taille(m)²
hi: निश्चित नहीं? बीएमआई = वजन(किग्रा) / ऊंचाई(मी)²

source: Physical Activity Level
es: Nivel de Actividad Física
fr: Niveau d'Activité Physique
hi: शारीरिक गतिविधि स्तर

source: Select activity level
es: Selecciona nivel de actividad
fr: Sélectionnez le niveau d'activité
hi: गतिविधि स्तर चुनें

source: Low (Sedentary)
es: Bajo (Sedentario)
fr: Faible (Sédentaire)
hi: कम (गतिहीन)

source: Moderate (3-5 days/week)
es: Moderado (3-5 días/semana)
fr: Modéré (3-5 jours/semaine)
hi: मध्यम (3-5 दिन/सप्ताह)

source: High (Daily or intense exercise)
es: Alto (Ejercicio diario o intenso)
fr: Élevé (Exercice quotidien ou intense)
hi: उच्च (दैनिक या तीव्र व्यायाम)

source: Generate Plan
es: Generar Plan
fr: Générer le Plan
hi: योजना बनाएं

source: Generating...
es: Generando...
fr: Génération...
hi: बना रहा हूं...

source: Something went wrong. Please try again.
es: Algo salió mal. Por favor, inténtalo de nuevo.
fr: Une erreur s'est produite. Veuillez réessayer.
hi: कुछ गलत हो गया। कृपया पुनः प्रयास करें।

source: Diet & Nutrition
es: Dieta y Nutrición
fr: Alimentation et Nutrition
hi: आहार और पोषण

source: Exercise & Activity
es: Ejercicio y Actividad
fr: Exercice et Activité
hi: व्यायाम और गतिविधि

source: Stress Management
es: Manejo del Estrés
fr: Gestion du Stress
hi: तनाव प्रबंधन

source: Sleep & Recovery
es: Sueño y Recuperación
fr: Sommeil et Récupération
hi: नींद और रिकवरी

source: Health Monitoring
es: Monitoreo de Salud
fr: Suivi de Santé
hi: स्वास्थ्य निगरानी

source: Activity
es: Actividad
fr: Activité
hi: गतिविधि

source: Your Custom Lifestyle Plan
es: Tu Plan de Estilo de Vida Personalizado
fr: Votre Plan de Mode de Vie Personnalisé
hi: आपकी कस्टम जीवनशैली योजना

source: Personalized with AI
es: Personalizado con IA
fr: Personnalisé avec l'IA
hi: AI के साथ व्यक्तिगत

source: Error
fr: Erreur
hi: त्रुटि

source: Select language
es: Seleccionar idioma
fr: Sélectionner la langue
hi: भाषा चुनें
